; ModuleID = 'codon'
source_filename = "/home/john/gh_synced/quantecon/workshops/tokyo_college_2023/code/codon/fib.py"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"Tuple.N1[int]:Tuple.N1.__iter__:0[Tuple.N1[int]].148.Frame" = type { ptr, ptr, i64, { i64 }, i2 }
%"Tuple.N2[str,str]:Tuple.N2.__iter__:0[Tuple.N2[str,str]].171.Frame" = type { ptr, ptr, { i64, ptr }, { { i64, ptr }, { i64, ptr } }, i2 }
%"Tuple.N0.__iter__:0[Tuple.N0].269.Frame" = type { ptr, ptr, i64, ptr, i64, i64, i2 }

@.argv = private global { i64, ptr } zeroinitializer, !dbg !0
@INSERTION_SORT_THRESHOLD = private global i64 0, !dbg !5
@MIN_GALLOP = private global i64 0, !dbg !9
@NINTHER_THRESHOLD = private global i64 0, !dbg !12
@PARTIAL_INSERTION_SORT_LIMIT = private global i64 0, !dbg !14
@PyBool_FromLong = private global ptr null, !dbg !16
@PyBytes_AsString = private global ptr null, !dbg !24
@PyComplex_FromDoubles = private global ptr null, !dbg !29
@PyComplex_ImagAsDouble = private global ptr null, !dbg !35
@PyComplex_RealAsDouble = private global ptr null, !dbg !40
@PyDict_GetItem = private global ptr null, !dbg !42
@PyDict_New = private global ptr null, !dbg !47
@PyDict_Next = private global ptr null, !dbg !52
@PyDict_SetItem = private global ptr null, !dbg !59
@PyErr_Fetch = private global ptr null, !dbg !64
@PyErr_NormalizeException = private global ptr null, !dbg !72

!247 = distinct !DIGlobalVariable(name: "PyTuple_GetItem", linkageName: "PyTuple_GetItem", scope: !2, file: !18, line: 38, type: !95, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "PyTuple_New", linkageName: "PyTuple_New", scope: !2, file: !18, line: 36, type: !19, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "PyTuple_SetItem", linkageName: "PyTuple_SetItem", scope: !2, file: !18, line: 39, type: !252, isLocal: true, isDefinition: true)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!69, !22, !8, !22}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "PyTuple_Size", linkageName: "PyTuple_Size", scope: !2, file: !18, line: 37, type: !107, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "PyUnicode_AsEncodedString", linkageName: "PyUnicode_AsEncodedString", scope: !2, file: !18, line: 40, type: !61, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "PyUnicode_DecodeFSDefaultAndSize", linkageName: "PyUnicode_DecodeFSDefaultAndSize", scope: !2, file: !18, line: 41, type: !95, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "PyUnicode_FromString", linkageName: "PyUnicode_FromString", scope: !2, file: !18, line: 42, type: !26, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "Py_DecRef", linkageName: "Py_DecRef", scope: !2, file: !18, line: 8, type: !232, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "Py_EQ", linkageName: "Py_EQ", scope: !2, file: !18, line: 111, type: !8, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "Py_False", linkageName: "Py_False", scope: !2, file: !18, line: 108, type: !22, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "Py_GE", linkageName: "Py_GE", scope: !2, file: !18, line: 114, type: !8, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "Py_GT", linkageName: "Py_GT", scope: !2, file: !18, line: 113, type: !8, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "Py_IncRef", linkageName: "Py_IncRef", scope: !2, file: !18, line: 9, type: !232, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "Py_Initialize", linkageName: "Py_Initialize", scope: !2, file: !18, line: 10, type: !277, isLocal: true, isDefinition: true)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!69}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "Py_LE", linkageName: "Py_LE", scope: !2, file: !18, line: 110, type: !8, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "Py_LT", linkageName: "Py_LT", scope: !2, file: !18, line: 109, type: !8, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "Py_NE", linkageName: "Py_NE", scope: !2, file: !18, line: 112, type: !8, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "Py_None", linkageName: "Py_None", scope: !2, file: !18, line: 106, type: !22, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "Py_True", linkageName: "Py_True", scope: !2, file: !18, line: 107, type: !22, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "RTLD_GLOBAL", linkageName: "RTLD_GLOBAL", scope: !2, file: !292, line: 15, type: !8, isLocal: true, isDefinition: true)
!292 = !DIFile(filename: "dlopen.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal")
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "RTLD_LOCAL", linkageName: "RTLD_LOCAL", scope: !2, file: !292, line: 16, type: !8, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "RTLD_NOW", linkageName: "RTLD_NOW", scope: !2, file: !292, line: 14, type: !8, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "_DEFAULT_IDENT", linkageName: "_DEFAULT_IDENT", scope: !2, file: !299, line: 95, type: !300, isLocal: true, isDefinition: true)
!299 = !DIFile(filename: "openmp.codon", directory: "/home/john/.codon/lib/codon/stdlib")
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !301)
!301 = !{!302, !303, !304, !305, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !300, file: !299, line: 45, baseType: !204, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !300, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !300, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !300, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "_KMP_IDENT_KMPC", linkageName: "_KMP_IDENT_KMPC", scope: !2, file: !299, line: 8, type: !8, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "_PY_INIT", linkageName: "_PY_INIT", scope: !2, file: !18, line: 118, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !311, file: !70, line: 87, baseType: !8, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !311, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "_PY_INITIALIZED", linkageName: "_PY_INITIALIZED", scope: !2, file: !18, line: 150, type: !317, isLocal: true, isDefinition: true)
!317 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "_PY_MODULE_CACHE", linkageName: "_PY_MODULE_CACHE", scope: !2, file: !18, line: 116, type: !320, isLocal: true, isDefinition: true)
!320 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !323)
!322 = !DIFile(filename: "", directory: ".")
!323 = !{!324, !326, !327, !328, !329, !332, !338}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !321, file: !325, line: 12, baseType: !8, size: 64)
!325 = !DIFile(filename: "dict.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types/collections")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !321, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !321, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !321, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !321, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIBasicType(name: "UInt32", size: 32, encoding: DW_ATE_unsigned)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !321, file: !325, line: 18, baseType: !333, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !334, file: !70, line: 87, baseType: !8, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !334, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !321, file: !325, line: 19, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !342)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !341, file: !70, line: 83, baseType: !22, size: 64)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "_REDUCTION_IDENT", linkageName: "_REDUCTION_IDENT", scope: !2, file: !299, line: 97, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !347)
!347 = !{!348, !349, !350, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !346, file: !299, line: 45, baseType: !204, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !346, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !346, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !346, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "_STATIC_LOOP_IDENT", linkageName: "_STATIC_LOOP_IDENT", scope: !2, file: !299, line: 96, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !356)
!356 = !{!357, !358, !359, !360, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !355, file: !299, line: 45, baseType: !204, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !355, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !355, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !355, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "__vtables__", linkageName: "__vtables__", scope: !2, file: !364, line: 449, type: !365, isLocal: true, isDefinition: true)
!364 = !DIFile(filename: "internal.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal")
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "_default_lock", linkageName: "_default_lock", scope: !2, file: !299, line: 792, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !299, file: !299, line: 29, size: 256, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !368, file: !299, line: 30, baseType: !204, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !368, file: !299, line: 31, baseType: !204, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !368, file: !299, line: 32, baseType: !204, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !368, file: !299, line: 33, baseType: !204, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !368, file: !299, line: 34, baseType: !204, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !368, file: !299, line: 35, baseType: !204, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !368, file: !299, line: 36, baseType: !204, size: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !368, file: !299, line: 37, baseType: !204, size: 32, offset: 224)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "_stdout", linkageName: "_stdout", scope: !2, file: !380, line: 16, type: !22, isLocal: true, isDefinition: true)
!380 = !DIFile(filename: "builtin.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal")
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "block", linkageName: "block", scope: !2, file: !383, line: 216, type: !384, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "gpu.codon", directory: "/home/john/.codon/lib/codon/stdlib")
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Block", scope: !383, file: !383, line: 117, elements: !71)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "environ", linkageName: "environ", scope: !2, file: !387, line: 54, type: !388, isLocal: true, isDefinition: true)
!387 = !DIFile(filename: "__init__.codon", directory: "/home/john/.codon/lib/codon/stdlib/os")
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.__init__.EnvMap", scope: !387, file: !387, line: 11, size: 64, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_map", scope: !388, file: !387, line: 12, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !405}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !392, file: !325, line: 12, baseType: !8, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !392, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !392, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !392, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !392, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !392, file: !325, line: 18, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !401, file: !70, line: 87, baseType: !8, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !401, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !392, file: !325, line: 19, baseType: !400, size: 64, offset: 384)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "float", linkageName: "float.MIN_10_EXP", scope: !2, file: !70, line: 25, type: !8, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "float32", linkageName: "float32.MIN_10_EXP", scope: !2, file: !70, line: 31, type: !8, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "grid", linkageName: "grid", scope: !2, file: !383, line: 217, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Grid", scope: !383, file: !383, line: 177, elements: !71)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "int", linkageName: "int.MAX", scope: !2, file: !70, line: 19, type: !8, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "thread", linkageName: "thread", scope: !2, file: !383, line: 215, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Thread", scope: !383, file: !383, line: 82, elements: !71)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "warp", linkageName: "warp", scope: !2, file: !383, line: 218, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.gpu.Warp", scope: !383, file: !383, line: 204, elements: !71)
!421 = !DIFile(filename: "<internal>", directory: ".")
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: ".Array[str]", scope: !322, file: !322, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !422, file: !322, baseType: !8, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !422, file: !322, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !427, file: !70, line: 87, baseType: !8, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !427, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!431 = !{i32 2, !"Debug Info Version", i32 3}
!432 = distinct !DISubprogram(name: "__internal__.class_init_vtables", linkageName: "__internal__.class_init_vtables:0.2", scope: !364, file: !364, line: 47, type: !433, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!433 = !DISubroutineType(types: !434)
!434 = !{!365}
!435 = !DILocation(line: 47, column: 5, scope: !432)
!436 = !DILocation(line: 0, scope: !432)
!437 = distinct !DISubprogram(name: "check_N", linkageName: "std.internal.types.intn.check_N:0[,32].14", scope: !438, file: !438, line: 5, type: !278, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!438 = !DIFile(filename: "intn.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types")
!439 = !DILocation(line: 5, column: 1, scope: !437)
!440 = distinct !DISubprogram(name: "Int32.__new__", linkageName: "Int[32]:Int.__new__:2[int].17", scope: !438, file: !438, line: 20, type: !441, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!204, !8}
!443 = !{!444}
!444 = !DILocalVariable(name: "what", arg: 1, scope: !440, file: !322, type: !8)
!445 = !DILocation(line: 20, column: 5, scope: !440)
!446 = !DILocation(line: 0, scope: !440)
!447 = !DILocation(line: 21, column: 9, scope: !440)
!448 = !DILocation(line: 23, column: 43, scope: !440)
!449 = !DILocation(line: 184, column: 5, scope: !450, inlinedAt: !451)
!450 = distinct !DISubprogram(name: "__internal__.int_trunc", linkageName: "__internal__.int_trunc:0[int,64,32].15", scope: !364, file: !364, line: 184, type: !441, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!451 = distinct !DILocation(line: 23, column: 43, scope: !440)
!452 = distinct !DISubprogram(name: "std.openmp.Ident.__new__", linkageName: "std.openmp.Ident.__new__:1[int,str].28", scope: !299, file: !299, line: 51, type: !453, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !466)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !8, !462}
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !456)
!456 = !{!457, !458, !459, !460, !461}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !455, file: !299, line: 45, baseType: !204, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !455, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !455, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !455, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !70, line: 87, baseType: !8, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !462, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!466 = !{!467, !468}
!467 = !DILocalVariable(name: "flags", arg: 1, scope: !452, file: !322, type: !8)
!468 = !DILocalVariable(name: "source", arg: 2, scope: !452, file: !322, type: !469)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !469, file: !70, line: 87, baseType: !8, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !469, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!473 = !DILocation(line: 51, column: 5, scope: !452)
!474 = !DILocation(line: 0, scope: !452)
!475 = !DILocation(line: 52, column: 26, scope: !452)
!476 = !DILocation(line: 52, column: 34, scope: !452)
!477 = !DILocation(line: 52, column: 42, scope: !452)
!478 = !DILocation(line: 201, column: 5, scope: !479, inlinedAt: !483)
!479 = distinct !DISubprogram(name: "int.__or__", linkageName: "int.__or__:0[int,int].19", scope: !480, file: !480, line: 201, type: !481, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!480 = !DIFile(filename: "int.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types")
!481 = !DISubroutineType(types: !482)
!482 = !{!8, !8, !8}
!483 = distinct !DILocation(line: 52, column: 42, scope: !452)
!484 = !DILocation(line: 52, column: 64, scope: !452)
!485 = !DILocation(line: 52, column: 72, scope: !452)
!486 = !DILocation(line: 52, column: 76, scope: !452)
!487 = !DILocation(line: 301, column: 301, scope: !488, inlinedAt: !499)
!488 = distinct !DISubprogram(name: "std.openmp.Ident.__new__", linkageName: "std.openmp.Ident.__new__:0.22", scope: !489, file: !489, line: 301, type: !490, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!489 = !DIFile(filename: "<generated>", directory: ".")
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !204, !204, !204, !204, !22}
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !493)
!493 = !{!494, !495, !496, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !492, file: !299, line: 45, baseType: !204, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !492, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !492, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !492, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!499 = distinct !DILocation(line: 52, column: 76, scope: !452)
!500 = distinct !DISubprogram(name: "_default_loc", linkageName: "std.openmp._default_loc:0.31", scope: !299, file: !299, line: 99, type: !501, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!501 = !DISubroutineType(types: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !505)
!505 = !{!506, !507, !508, !509, !510}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !504, file: !299, line: 45, baseType: !204, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !504, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !504, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !504, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!511 = !DILocation(line: 99, column: 1, scope: !500)
!512 = !DILocation(line: 100, column: 12, scope: !500)
!513 = distinct !DISubprogram(name: "_static_loop_loc", linkageName: "std.openmp._static_loop_loc:0.32", scope: !299, file: !299, line: 104, type: !514, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!514 = !DISubroutineType(types: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !518)
!518 = !{!519, !520, !521, !522, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !517, file: !299, line: 45, baseType: !204, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !517, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !517, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !517, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !517, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!524 = !DILocation(line: 104, column: 1, scope: !513)
!525 = !DILocation(line: 105, column: 12, scope: !513)
!526 = distinct !DISubprogram(name: "_reduction_loc", linkageName: "std.openmp._reduction_loc:0.33", scope: !299, file: !299, line: 109, type: !527, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!527 = !DISubroutineType(types: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Ident", scope: !299, file: !299, line: 44, size: 192, elements: !531)
!531 = !{!532, !533, !534, !535, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_1", scope: !530, file: !299, line: 45, baseType: !204, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !299, line: 46, baseType: !204, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_2", scope: !530, file: !299, line: 47, baseType: !204, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_3", scope: !530, file: !299, line: 48, baseType: !204, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "psource", scope: !530, file: !299, line: 49, baseType: !22, size: 64, offset: 128)
!537 = !DILocation(line: 109, column: 1, scope: !526)
!538 = !DILocation(line: 110, column: 12, scope: !526)
!539 = distinct !DISubprogram(name: "std.openmp.Lock.__new__", linkageName: "std.openmp.Lock.__new__:1.43", scope: !299, file: !299, line: 39, type: !540, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !552)
!540 = !DISubroutineType(types: !541)
!541 = !{!542}
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !299, file: !299, line: 29, size: 256, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !542, file: !299, line: 30, baseType: !204, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !542, file: !299, line: 31, baseType: !204, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !542, file: !299, line: 32, baseType: !204, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !542, file: !299, line: 33, baseType: !204, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !542, file: !299, line: 34, baseType: !204, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !542, file: !299, line: 35, baseType: !204, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !542, file: !299, line: 36, baseType: !204, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !542, file: !299, line: 37, baseType: !204, size: 32, offset: 224)
!552 = !{!553}
!553 = !DILocalVariable(name: "z", scope: !539, file: !299, line: 40, type: !204)
!554 = !DILocation(line: 39, column: 5, scope: !539)
!555 = !DILocation(line: 40, column: 9, scope: !539)
!556 = !DILocation(line: 40, column: 17, scope: !539)
!557 = !DILocation(line: 41, column: 21, scope: !539)
!558 = !DILocation(line: 41, column: 24, scope: !539)
!559 = !DILocation(line: 41, column: 27, scope: !539)
!560 = !DILocation(line: 41, column: 30, scope: !539)
!561 = !DILocation(line: 41, column: 33, scope: !539)
!562 = !DILocation(line: 41, column: 36, scope: !539)
!563 = !DILocation(line: 41, column: 39, scope: !539)
!564 = !DILocation(line: 41, column: 42, scope: !539)
!565 = !DILocation(line: 280, column: 280, scope: !566, inlinedAt: !579)
!566 = distinct !DISubprogram(name: "std.openmp.Lock.__new__", linkageName: "std.openmp.Lock.__new__:0.34", scope: !489, file: !489, line: 280, type: !567, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !204, !204, !204, !204, !204, !204, !204, !204}
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.openmp.Lock", scope: !299, file: !299, line: 29, size: 256, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !569, file: !299, line: 30, baseType: !204, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !569, file: !299, line: 31, baseType: !204, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !569, file: !299, line: 32, baseType: !204, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !569, file: !299, line: 33, baseType: !204, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "a5", scope: !569, file: !299, line: 34, baseType: !204, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "a6", scope: !569, file: !299, line: 35, baseType: !204, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "a7", scope: !569, file: !299, line: 36, baseType: !204, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "a8", scope: !569, file: !299, line: 37, baseType: !204, size: 32, offset: 224)
!579 = distinct !DILocation(line: 41, column: 42, scope: !539)
!580 = distinct !DISubprogram(name: "_catch", linkageName: "std.gpu._catch:0.53", scope: !383, file: !383, line: 220, type: !581, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!581 = !DISubroutineType(types: !582)
!582 = !{!583}
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp]", scope: !489, file: !489, line: 776, elements: !584)
!584 = !{!585, !587, !588, !589}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !583, file: !586, line: 9, baseType: !417)
!586 = !DIFile(filename: "slice.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types")
!587 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !583, file: !586, line: 9, baseType: !384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !583, file: !586, line: 9, baseType: !412)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !583, file: !586, line: 9, baseType: !420)
!590 = !DILocation(line: 220, column: 1, scope: !580)
!591 = !DILocation(line: 221, column: 13, scope: !580)
!592 = !DILocation(line: 221, column: 21, scope: !580)
!593 = !DILocation(line: 221, column: 28, scope: !580)
!594 = !DILocation(line: 221, column: 34, scope: !580)
!595 = !DILocation(line: 792, column: 792, scope: !596, inlinedAt: !605)
!596 = distinct !DISubprogram(name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp].__new__", linkageName: "Tuple.N4.__new__:0.48", scope: !489, file: !489, line: 792, type: !597, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!597 = !DISubroutineType(types: !598)
!598 = !{!599, !417, !384, !412, !420}
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N4[std.gpu.Thread,std.gpu.Block,std.gpu.Grid,std.gpu.Warp]", scope: !489, file: !489, line: 776, elements: !600)
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !599, file: !586, line: 9, baseType: !417)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !599, file: !586, line: 9, baseType: !384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "item3", scope: !599, file: !586, line: 9, baseType: !412)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "item4", scope: !599, file: !586, line: 9, baseType: !420)
!605 = distinct !DILocation(line: 221, column: 34, scope: !580)
!606 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str].__tuplesize__", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict.__tuplesize__:0.55", scope: !489, file: !489, line: 236, type: !607, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!607 = !DISubroutineType(types: !608)
!608 = !{!8}
!609 = !DILocation(line: 236, column: 236, scope: !606)
!610 = !DILocation(line: 11, column: 1, scope: !606)
!611 = distinct !DISubprogram(name: "register_finalizer", linkageName: "std.internal.gc.register_finalizer:0[Ptr[byte]].60", scope: !612, file: !612, line: 82, type: !233, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !613)
!612 = !DIFile(filename: "gc.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal")
!613 = !{!614}
!614 = !DILocalVariable(name: "p", arg: 1, scope: !611, file: !322, type: !22)
!615 = !DILocation(line: 82, column: 1, scope: !611)
!616 = !DILocation(line: 0, scope: !611)
!617 = distinct !DISubprogram(name: "__internal__.class_set_obj_vtable", linkageName: "__internal__.class_set_obj_vtable:0[std.internal.types.collections.dict.Dict[str,str],std.internal.types.collections.dict.Dict[str,str]].64", scope: !364, file: !364, line: 39, type: !618, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !635)
!618 = !DISubroutineType(types: !619)
!619 = !{!69, !620}
!620 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !634}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !621, file: !325, line: 12, baseType: !8, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !621, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !621, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !621, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !621, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !621, file: !325, line: 18, baseType: !629, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !630, file: !70, line: 87, baseType: !8, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !630, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !621, file: !325, line: 19, baseType: !629, size: 64, offset: 384)
!635 = !{!636}
!636 = !DILocalVariable(name: "pf", arg: 1, scope: !617, file: !322, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !651}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !638, file: !325, line: 12, baseType: !8, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !638, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !638, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !638, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !638, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !638, file: !325, line: 18, baseType: !646, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !647, file: !70, line: 87, baseType: !8, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !647, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !638, file: !325, line: 19, baseType: !646, size: 64, offset: 384)
!652 = !DILocation(line: 39, column: 5, scope: !617)
!653 = !DILocation(line: 0, scope: !617)
!654 = distinct !DISubprogram(name: "__internal__.class_new", linkageName: "__internal__.class_new:0[,std.internal.types.collections.dict.Dict[str,str]].66", scope: !364, file: !364, line: 26, type: !655, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !672)
!655 = !DISubroutineType(types: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !658)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !671}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !658, file: !325, line: 12, baseType: !8, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !658, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !658, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !658, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !658, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !658, file: !325, line: 18, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !667, file: !70, line: 87, baseType: !8, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !667, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !658, file: !325, line: 19, baseType: !666, size: 64, offset: 384)
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(name: "sz", scope: !654, file: !364, line: 28, type: !8)
!674 = !DILocalVariable(name: "p", scope: !654, file: !364, line: 29, type: !22)
!675 = !DILocalVariable(name: "pf", scope: !654, file: !364, line: 31, type: !676)
!676 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !677)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !690}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !677, file: !325, line: 12, baseType: !8, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !677, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !677, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !677, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !677, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !677, file: !325, line: 18, baseType: !685, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !686, file: !70, line: 87, baseType: !8, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !686, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !677, file: !325, line: 19, baseType: !685, size: 64, offset: 384)
!691 = !DILocation(line: 26, column: 5, scope: !654)
!692 = !DILocation(line: 28, column: 9, scope: !654)
!693 = !DILocation(line: 29, column: 9, scope: !654)
!694 = !DILocation(line: 31, column: 9, scope: !654)
!695 = !DILocation(line: 28, column: 14, scope: !654)
!696 = !DILocation(line: 29, column: 37, scope: !654)
!697 = !DILocation(line: 29, column: 30, scope: !654)
!698 = !DILocation(line: 29, column: 65, scope: !654)
!699 = !DILocation(line: 30, column: 28, scope: !654)
!700 = !DILocation(line: 31, column: 40, scope: !654)
!701 = !DILocation(line: 32, column: 43, scope: !654)
!702 = !DILocation(line: 33, column: 16, scope: !654)
!703 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str].__new__", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict.__new__:0.67", scope: !489, file: !489, line: 233, type: !704, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!704 = !DISubroutineType(types: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !707)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !720}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !707, file: !325, line: 12, baseType: !8, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !707, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !707, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !707, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !707, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !707, file: !325, line: 18, baseType: !715, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !716, file: !70, line: 87, baseType: !8, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !716, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !707, file: !325, line: 19, baseType: !715, size: 64, offset: 384)
!721 = !DILocation(line: 233, column: 233, scope: !703)
!722 = !DILocation(line: 11, column: 1, scope: !703)
!723 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str]._init", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict._init:0[std.internal.types.collections.dict.Dict[str,str]].70", scope: !325, file: !325, line: 26, type: !724, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !741)
!724 = !DISubroutineType(types: !725)
!725 = !{!69, !726}
!726 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !727)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !740}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !727, file: !325, line: 12, baseType: !8, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !727, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !727, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !727, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !727, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !727, file: !325, line: 18, baseType: !735, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !736, file: !70, line: 87, baseType: !8, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !736, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !727, file: !325, line: 19, baseType: !735, size: 64, offset: 384)
!741 = !{!742}
!742 = !DILocalVariable(name: "self", arg: 1, scope: !723, file: !322, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !744)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !757}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !744, file: !325, line: 12, baseType: !8, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !744, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !744, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !744, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !744, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !744, file: !325, line: 18, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !753, file: !70, line: 87, baseType: !8, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !753, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !744, file: !325, line: 19, baseType: !752, size: 64, offset: 384)
!758 = !DILocation(line: 26, column: 5, scope: !723)
!759 = !DILocation(line: 0, scope: !723)
!760 = !DILocation(line: 27, column: 9, scope: !723)
!761 = !DILocation(line: 27, column: 27, scope: !723)
!762 = !DILocation(line: 28, column: 9, scope: !723)
!763 = !DILocation(line: 28, column: 22, scope: !723)
!764 = !DILocation(line: 29, column: 9, scope: !723)
!765 = !DILocation(line: 29, column: 28, scope: !723)
!766 = !DILocation(line: 30, column: 9, scope: !723)
!767 = !DILocation(line: 30, column: 29, scope: !723)
!768 = !DILocation(line: 31, column: 9, scope: !723)
!769 = !DILocation(line: 31, column: 23, scope: !723)
!770 = !DILocation(line: 32, column: 9, scope: !723)
!771 = !DILocation(line: 32, column: 22, scope: !723)
!772 = !DILocation(line: 33, column: 9, scope: !723)
!773 = !DILocation(line: 33, column: 22, scope: !723)
!774 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,str].__init__", linkageName: "std.internal.types.collections.dict.Dict[str,str]:std.internal.types.collections.dict.Dict.__init__:1[std.internal.types.collections.dict.Dict[str,str]].72", scope: !325, file: !325, line: 59, type: !775, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !792)
!775 = !DISubroutineType(types: !776)
!776 = !{!69, !777}
!777 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !791}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !778, file: !325, line: 12, baseType: !8, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !778, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !778, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !778, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !778, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !778, file: !325, line: 18, baseType: !786, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !787, file: !70, line: 87, baseType: !8, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !787, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !778, file: !325, line: 19, baseType: !786, size: 64, offset: 384)
!792 = !{!793}
!793 = !DILocalVariable(name: "self", arg: 1, scope: !774, file: !322, type: !794)
!794 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !808}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !795, file: !325, line: 12, baseType: !8, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !795, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !795, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !795, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !795, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !795, file: !325, line: 18, baseType: !803, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !804, file: !70, line: 87, baseType: !8, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !804, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !795, file: !325, line: 19, baseType: !803, size: 64, offset: 384)
!809 = !DILocation(line: 59, column: 5, scope: !774)
!810 = !DILocation(line: 0, scope: !774)
!811 = !DILocation(line: 60, column: 9, scope: !774)
!812 = distinct !DISubprogram(name: "std.os.__init__.EnvMap.__new__", linkageName: "std.os.__init__.EnvMap.__new__:1.76", scope: !387, file: !387, line: 14, type: !813, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !833)
!813 = !DISubroutineType(types: !814)
!814 = !{!815}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.__init__.EnvMap", scope: !387, file: !387, line: 11, size: 64, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_map", scope: !815, file: !387, line: 12, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !819)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !832}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !819, file: !325, line: 12, baseType: !8, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !819, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !819, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !819, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !819, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !819, file: !325, line: 18, baseType: !827, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !828, file: !70, line: 87, baseType: !8, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !828, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !819, file: !325, line: 19, baseType: !827, size: 64, offset: 384)
!833 = !{!834}
!834 = !DILocalVariable(name: "._ctr_120", scope: !812, file: !387, line: 15, type: !835)
!835 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !849}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !836, file: !325, line: 12, baseType: !8, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !836, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !836, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !836, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !836, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !836, file: !325, line: 18, baseType: !844, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !845, file: !70, line: 87, baseType: !8, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !845, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !836, file: !325, line: 19, baseType: !844, size: 64, offset: 384)
!850 = !DILocation(line: 14, column: 5, scope: !812)
!851 = !DILocation(line: 15, column: 17, scope: !812)
!852 = !DILocation(line: 654, column: 654, scope: !853, inlinedAt: !874)
!853 = distinct !DISubprogram(name: "Tuple.N1[std.internal.types.collections.dict.Dict[str,str]].__new__", linkageName: "Tuple.N1.__new__:0.74", scope: !489, file: !489, line: 654, type: !854, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!854 = !DISubroutineType(types: !855)
!855 = !{!856, !859}
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N1[std.internal.types.collections.dict.Dict[str,str]]", scope: !489, file: !489, line: 638, size: 64, elements: !857)
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !856, file: !70, line: 100, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !860)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,str].contents", scope: !322, file: !322, size: 448, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !873}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !860, file: !325, line: 12, baseType: !8, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !860, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !860, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !860, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !860, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !860, file: !325, line: 18, baseType: !868, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !869, file: !70, line: 87, baseType: !8, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !869, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !860, file: !325, line: 19, baseType: !868, size: 64, offset: 384)
!874 = distinct !DILocation(line: 15, column: 17, scope: !812)
!875 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,pyobj].__tuplesize__", linkageName: "std.internal.types.collections.dict.Dict[str,pyobj]:std.internal.types.collections.dict.Dict.__tuplesize__:0.122", scope: !489, file: !489, line: 236, type: !607, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!876 = !DILocation(line: 236, column: 236, scope: !875)
!877 = !DILocation(line: 11, column: 1, scope: !875)
!878 = distinct !DISubprogram(name: "__internal__.class_set_obj_vtable", linkageName: "__internal__.class_set_obj_vtable:0[std.internal.types.collections.dict.Dict[str,pyobj],std.internal.types.collections.dict.Dict[str,pyobj]].125", scope: !364, file: !364, line: 39, type: !879, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !901)
!879 = !DISubroutineType(types: !880)
!880 = !{!69, !881}
!881 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !882)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !895}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !882, file: !325, line: 12, baseType: !8, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !882, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !882, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !882, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !882, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !882, file: !325, line: 18, baseType: !890, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !891, file: !70, line: 87, baseType: !8, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !891, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !882, file: !325, line: 19, baseType: !896, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !898)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !899)
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !898, file: !70, line: 83, baseType: !22, size: 64)
!901 = !{!902}
!902 = !DILocalVariable(name: "pf", arg: 1, scope: !878, file: !322, type: !903)
!903 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !904)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !917}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !904, file: !325, line: 12, baseType: !8, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !904, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !904, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !904, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !904, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !904, file: !325, line: 18, baseType: !912, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !913, file: !70, line: 87, baseType: !8, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !913, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !904, file: !325, line: 19, baseType: !918, size: 64, offset: 384)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !920)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !921)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !920, file: !70, line: 83, baseType: !22, size: 64)
!923 = !DILocation(line: 39, column: 5, scope: !878)
!924 = !DILocation(line: 0, scope: !878)
!925 = distinct !DISubprogram(name: "__internal__.class_new", linkageName: "__internal__.class_new:0[,std.internal.types.collections.dict.Dict[str,pyobj]].127", scope: !364, file: !364, line: 26, type: !926, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !948)
!926 = !DISubroutineType(types: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !929)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !942}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !929, file: !325, line: 12, baseType: !8, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !929, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !929, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !929, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !929, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !929, file: !325, line: 18, baseType: !937, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !938, file: !70, line: 87, baseType: !8, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !938, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !929, file: !325, line: 19, baseType: !943, size: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !945)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !945, file: !70, line: 83, baseType: !22, size: 64)
!948 = !{!949, !950, !951}
!949 = !DILocalVariable(name: "sz", scope: !925, file: !364, line: 28, type: !8)
!950 = !DILocalVariable(name: "p", scope: !925, file: !364, line: 29, type: !22)
!951 = !DILocalVariable(name: "pf", scope: !925, file: !364, line: 31, type: !952)
!952 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !953)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !966}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !953, file: !325, line: 12, baseType: !8, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !953, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !953, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !953, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !953, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !953, file: !325, line: 18, baseType: !961, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !962, file: !70, line: 87, baseType: !8, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !962, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !953, file: !325, line: 19, baseType: !967, size: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !969)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !969, file: !70, line: 83, baseType: !22, size: 64)
!972 = !DILocation(line: 26, column: 5, scope: !925)
!973 = !DILocation(line: 28, column: 9, scope: !925)
!974 = !DILocation(line: 29, column: 9, scope: !925)
!975 = !DILocation(line: 31, column: 9, scope: !925)
!976 = !DILocation(line: 28, column: 14, scope: !925)
!977 = !DILocation(line: 29, column: 37, scope: !925)
!978 = !DILocation(line: 29, column: 30, scope: !925)
!979 = !DILocation(line: 29, column: 65, scope: !925)
!980 = !DILocation(line: 30, column: 28, scope: !925)
!981 = !DILocation(line: 31, column: 40, scope: !925)
!982 = !DILocation(line: 32, column: 43, scope: !925)
!983 = !DILocation(line: 33, column: 16, scope: !925)
!984 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,pyobj].__new__", linkageName: "std.internal.types.collections.dict.Dict[str,pyobj]:std.internal.types.collections.dict.Dict.__new__:0.128", scope: !489, file: !489, line: 233, type: !985, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!985 = !DISubroutineType(types: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !988)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !1001}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !988, file: !325, line: 12, baseType: !8, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !988, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !988, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !988, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !988, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !988, file: !325, line: 18, baseType: !996, size: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !997, file: !70, line: 87, baseType: !8, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !997, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !988, file: !325, line: 19, baseType: !1002, size: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1004)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1004, file: !70, line: 83, baseType: !22, size: 64)
!1007 = !DILocation(line: 233, column: 233, scope: !984)
!1008 = !DILocation(line: 11, column: 1, scope: !984)
!1009 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,pyobj]._init", linkageName: "std.internal.types.collections.dict.Dict[str,pyobj]:std.internal.types.collections.dict.Dict._init:0[std.internal.types.collections.dict.Dict[str,pyobj]].130", scope: !325, file: !325, line: 26, type: !1010, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1032)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!69, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1013)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1026}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1013, file: !325, line: 12, baseType: !8, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1013, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1013, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1013, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1013, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1013, file: !325, line: 18, baseType: !1021, size: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1022, file: !70, line: 87, baseType: !8, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1022, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1013, file: !325, line: 19, baseType: !1027, size: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1029)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1029, file: !70, line: 83, baseType: !22, size: 64)
!1032 = !{!1033}
!1033 = !DILocalVariable(name: "self", arg: 1, scope: !1009, file: !322, type: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1035)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1048}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1035, file: !325, line: 12, baseType: !8, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1035, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1035, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1035, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1035, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1035, file: !325, line: 18, baseType: !1043, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1044, file: !70, line: 87, baseType: !8, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1044, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1035, file: !325, line: 19, baseType: !1049, size: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1051)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1051, file: !70, line: 83, baseType: !22, size: 64)
!1054 = !DILocation(line: 26, column: 5, scope: !1009)
!1055 = !DILocation(line: 0, scope: !1009)
!1056 = !DILocation(line: 27, column: 9, scope: !1009)
!1057 = !DILocation(line: 27, column: 27, scope: !1009)
!1058 = !DILocation(line: 28, column: 9, scope: !1009)
!1059 = !DILocation(line: 28, column: 22, scope: !1009)
!1060 = !DILocation(line: 29, column: 9, scope: !1009)
!1061 = !DILocation(line: 29, column: 28, scope: !1009)
!1062 = !DILocation(line: 30, column: 9, scope: !1009)
!1063 = !DILocation(line: 30, column: 29, scope: !1009)
!1064 = !DILocation(line: 31, column: 9, scope: !1009)
!1065 = !DILocation(line: 31, column: 23, scope: !1009)
!1066 = !DILocation(line: 32, column: 9, scope: !1009)
!1067 = !DILocation(line: 32, column: 22, scope: !1009)
!1068 = !DILocation(line: 33, column: 9, scope: !1009)
!1069 = !DILocation(line: 33, column: 22, scope: !1009)
!1070 = distinct !DISubprogram(name: "std.internal.types.collections.dict.Dict[str,pyobj].__init__", linkageName: "std.internal.types.collections.dict.Dict[str,pyobj]:std.internal.types.collections.dict.Dict.__init__:1[std.internal.types.collections.dict.Dict[str,pyobj]].132", scope: !325, file: !325, line: 59, type: !1071, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1093)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!69, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1074)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1087}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1074, file: !325, line: 12, baseType: !8, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1074, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1074, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1074, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1074, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1074, file: !325, line: 18, baseType: !1082, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1083, file: !70, line: 87, baseType: !8, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1083, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1074, file: !325, line: 19, baseType: !1088, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1090)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !1091)
!1091 = !{!1092}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1090, file: !70, line: 83, baseType: !22, size: 64)
!1093 = !{!1094}
!1094 = !DILocalVariable(name: "self", arg: 1, scope: !1070, file: !322, type: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1096)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.internal.types.collections.dict.Dict[str,pyobj].contents", scope: !322, file: !322, size: 448, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1109}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_n_buckets", scope: !1096, file: !325, line: 12, baseType: !8, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1096, file: !325, line: 13, baseType: !8, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_n_occupied", scope: !1096, file: !325, line: 14, baseType: !8, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_upper_bound", scope: !1096, file: !325, line: 15, baseType: !8, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1096, file: !325, line: 17, baseType: !330, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_keys", scope: !1096, file: !325, line: 18, baseType: !1104, size: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1105, file: !70, line: 87, baseType: !8, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1105, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_vals", scope: !1096, file: !325, line: 19, baseType: !1110, size: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "pyobj.contents", scope: !322, file: !322, size: 64, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1112, file: !70, line: 83, baseType: !22, size: 64)
!1115 = !DILocation(line: 59, column: 5, scope: !1070)
!1116 = !DILocation(line: 0, scope: !1070)
!1117 = !DILocation(line: 60, column: 9, scope: !1070)
!1118 = distinct !DISubprogram(name: "bool.__bool__", linkageName: "bool:bool.__bool__:0[bool].144", scope: !1119, file: !1119, line: 22, type: !1120, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1122)
!1119 = !DIFile(filename: "bool.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types")
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!317, !317}
!1122 = !{!1123}
!1123 = !DILocalVariable(name: "self", arg: 1, scope: !1118, file: !322, type: !317)
!1124 = !DILocation(line: 22, column: 5, scope: !1118)
!1125 = !DILocation(line: 0, scope: !1118)
!1126 = !DILocation(line: 23, column: 16, scope: !1118)
!1127 = distinct !DISubprogram(name: "Tuple.N1[int].__iter__", linkageName: "Tuple.N1[int]:Tuple.N1.__iter__:0[Tuple.N1[int]].148", scope: !489, file: !489, line: 649, type: !1128, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1134)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIBasicType(name: "Generator[int]", size: 64, encoding: DW_ATE_address)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N1[int]", scope: !489, file: !489, line: 638, size: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1131, file: !70, line: 100, baseType: !8, size: 64)
!1134 = !{!1135}
!1135 = !DILocalVariable(name: "self", arg: 1, scope: !1127, file: !322, type: !1136)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N1[int]", scope: !489, file: !489, line: 638, size: 64, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1136, file: !70, line: 100, baseType: !8, size: 64)
!1139 = !DILocation(line: 649, column: 649, scope: !1127)
!1140 = !DILocation(line: 0, scope: !1127)
!1141 = distinct !DISubprogram(name: "str.__bool__", linkageName: "str:str.__bool__:0[str].153", scope: !1142, file: !1142, line: 32, type: !1143, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1149)
!1142 = !DIFile(filename: "str.codon", directory: "/home/john/.codon/lib/codon/stdlib/internal/types")
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!317, !1145}
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1145, file: !70, line: 87, baseType: !8, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1145, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1149 = !{!1150}
!1150 = !DILocalVariable(name: "self", arg: 1, scope: !1141, file: !322, type: !1151)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1151, file: !70, line: 87, baseType: !8, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1151, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1155 = !DILocation(line: 32, column: 5, scope: !1141)
!1156 = !DILocation(line: 0, scope: !1141)
!1157 = !DILocation(line: 33, column: 16, scope: !1141)
!1158 = !DILocation(line: 273, column: 5, scope: !1159, inlinedAt: !1162)
!1159 = distinct !DISubprogram(name: "int.__ne__", linkageName: "int.__ne__:1[int,int].150", scope: !480, file: !480, line: 273, type: !1160, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!317, !8, !8}
!1162 = distinct !DILocation(line: 33, column: 28, scope: !1141)
!1163 = !DILocation(line: 33, column: 28, scope: !1141)
!1164 = distinct !DISubprogram(name: "str.__str__", linkageName: "str.__str__:0[str].164", scope: !1142, file: !1142, line: 26, type: !1165, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1171)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!1167, !1167}
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1167, file: !70, line: 87, baseType: !8, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1167, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1171 = !{!1172}
!1172 = !DILocalVariable(name: "what", arg: 1, scope: !1164, file: !322, type: !1173)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1173, file: !70, line: 87, baseType: !8, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1173, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1177 = !DILocation(line: 26, column: 5, scope: !1164)
!1178 = !DILocation(line: 0, scope: !1164)
!1179 = !DILocation(line: 27, column: 16, scope: !1164)
!1180 = distinct !DISubprogram(name: "str.__new__", linkageName: "str.__new__:3[str].166", scope: !1142, file: !1142, line: 20, type: !1181, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1187)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!1183, !1183}
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1184)
!1184 = !{!1185, !1186}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1183, file: !70, line: 87, baseType: !8, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1183, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1187 = !{!1188}
!1188 = !DILocalVariable(name: "what", arg: 1, scope: !1180, file: !322, type: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1189, file: !70, line: 87, baseType: !8, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1189, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1193 = !DILocation(line: 20, column: 5, scope: !1180)
!1194 = !DILocation(line: 0, scope: !1180)
!1195 = !DILocation(line: 22, column: 20, scope: !1180)
!1196 = distinct !DISubprogram(name: "Tuple.N2[str,str].__iter__", linkageName: "Tuple.N2[str,str]:Tuple.N2.__iter__:0[Tuple.N2[str,str]].171", scope: !489, file: !489, line: 672, type: !1197, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1208)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIBasicType(name: "Generator[str]", size: 64, encoding: DW_ATE_address)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N2[str,str]", scope: !489, file: !489, line: 661, size: 256, elements: !1201)
!1201 = !{!1202, !1207}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1200, file: !489, line: 639, baseType: !1203, size: 128)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1203, file: !70, line: 87, baseType: !8, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1203, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1200, file: !489, line: 639, baseType: !1203, size: 128, offset: 128)
!1208 = !{!1209}
!1209 = !DILocalVariable(name: "self", arg: 1, scope: !1196, file: !322, type: !1210)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N2[str,str]", scope: !489, file: !489, line: 661, size: 256, elements: !1211)
!1211 = !{!1212, !1217}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "item1", scope: !1210, file: !489, line: 639, baseType: !1213, size: 128)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1213, file: !70, line: 87, baseType: !8, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1213, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "item2", scope: !1210, file: !489, line: 639, baseType: !1213, size: 128, offset: 128)
!1218 = !DILocation(line: 672, column: 672, scope: !1196)
!1219 = !DILocation(line: 0, scope: !1196)
!1220 = distinct !DISubprogram(name: "str.__new__", linkageName: "str.__new__:1[Ptr[byte],int].188", scope: !1142, file: !1142, line: 14, type: !1221, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1227)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1223, !22, !8}
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1224)
!1224 = !{!1225, !1226}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1223, file: !70, line: 87, baseType: !8, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1223, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1227 = !{!1228, !1229}
!1228 = !DILocalVariable(name: "p", arg: 1, scope: !1220, file: !322, type: !22)
!1229 = !DILocalVariable(name: "l", arg: 2, scope: !1220, file: !322, type: !8)
!1230 = !DILocation(line: 14, column: 5, scope: !1220)
!1231 = !DILocation(line: 0, scope: !1220)
!1232 = !DILocation(line: 15, column: 20, scope: !1220)
!1233 = !DILocation(line: 15, column: 23, scope: !1220)
!1234 = !DILocation(line: 11, column: 5, scope: !1235, inlinedAt: !1242)
!1235 = distinct !DISubprogram(name: "str.__new__", linkageName: "str.__new__:0.185", scope: !1142, file: !1142, line: 11, type: !1236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !71)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1238, !8, !22}
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1239)
!1239 = !{!1240, !1241}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1238, file: !70, line: 87, baseType: !8, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1238, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1242 = distinct !DILocation(line: 15, column: 23, scope: !1220)
!1243 = distinct !DISubprogram(name: "str.cat", linkageName: "str.cat:0[Tuple.N2[str,str]].191", scope: !1142, file: !1142, line: 103, type: !1244, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !1254)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!1246, !1250}
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", scope: !70, file: !70, line: 87, size: 128, elements: !1247)
!1247 = !{!1248, !1249}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1246, file: !70, line: 87, baseType: !8, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1246, file: !70, line: 87, baseType: !22, size: 64, offset: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple.N2[str,str]", scope: !489, file: !489, line: 661, size: 256, elements: !1251)
!1251 = !{!1252, !1253}
